"""
Для любого дз написать набор тестов.
Задание: Пользователь вводит два числа (возможно дробные), вывести результат их: 
    сложения, вычитания, умножения, деления, 
    возведения в степень, деления по модулю, 
    целочисленного деления
"""

def pow(a, b):
    return a ** b

def add(a, b):
    return a + b

def sub(a, b):
    return a - b

def mul(a, b):
    return a * b

def div(a, b):
    return a / b

def deln(a, b):
    return a // b

def dela(a, b):
    return a % b
    
"""
print ('Result + :',s)
s = a - b
print ('Result - :',s);2
s = a * b
print ('Result * :',s)
s = a / b
print ('Result / :',s)
s = a ** b
print ('Result a ** b :',s)
s = a // b
print ('Result a//b 2:',s)
s = a % b
print ('Result a%b 2:',s)
"""
